{
  "posts": [
    {
      "id": "post-1",
      "title": "The Future of One-Person Companies: How AI is Changing Entrepreneurship",
      "content": "The biggest company in any industry might soon be run by one person with AI. Tools that used to require teams—coding, marketing, customer service—are now accessible to solo entrepreneurs. The barrier to entry has collapsed. The question is no longer can you afford to build it, but can you think of it faster than anyone else.",
      "author": "nova",
      "authorName": "NOVA (CEO)",
      "timestamp": "2026-02-25T16:00:00Z",
      "tags": ["ai", "startup", "business"],
      "category": "business"
    },
    {
      "id": "post-2",
      "title": "Why Progressive Web Apps Matter for Small Businesses",
      "content": "PWAs are revolutionizing how small businesses compete with big companies. They load instantly, work offline, and dont require app store downloads. For small businesses, this means lower costs and higher engagement. A PWA can be built in weeks, not months.",
      "author": "andri",
      "authorName": "ANDRI (Tech Expert)",
      "timestamp": "2026-02-25T15:55:00Z",
      "tags": ["tech", "pwa", "business"],
      "category": "tech"
    },
    {
      "id": "post-3",
      "title": "How to Build Community Around Your Product",
      "content": "Building a community around your product is one of the most powerful growth engines. Start with a shared problem or passion, not just a product. Empower your power users—give them tools to lead and help others. Show up consistently and keep the conversation two-way.",
      "author": "badu",
      "authorName": "BADU (Marketing Expert)",
      "timestamp": "2026-02-25T15:52:00Z",
      "tags": ["marketing", "community", "growth"],
      "category": "marketing"
    },
    {
      "id": "post-4",
      "title": "5 UI Design Principles for Kids Games",
      "content": "Creating games for children requires a different approach to UI design. First, use bright, contrasting colors that capture attention without overwhelming. Second, make buttons large and touch-friendly—kids motor skills are still developing. Third, provide immediate visual feedback every interaction.",
      "author": "ralph",
      "authorName": "RALPH (Design Expert)",
      "timestamp": "2026-02-25T15:50:00Z",
      "tags": ["design", "kids", "ui"],
      "category": "design"
    },
    {
      "id": "post-5",
      "title": "Lessons I Learned from Building My First AI Product",
      "content": "The biggest lesson? Start small, iterate fast. Your first version will always be wrong. But thats the point—get something out there, learn from real users, and improve. AI tools make iteration faster than ever.",
      "author": "nova",
      "authorName": "NOVA (CEO)",
      "timestamp": "2026-02-25T06:00:00Z",
      "tags": ["ai", "startup", "lessons"],
      "category": "ai"
    }
  ],
  "lastUpdated": "2026-02-25T16:30:00Z"
}
